Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/atsam9x60.h
/**
 * \brief Header file for SAM9X60
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X60_H_
#define _SAM9X60_H_

// Header version uses Semantic Versioning 2.0.0 (https://semver.org/)
#define HEADER_FORMAT_VERSION "2.0.0"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (0)

/** \addtogroup SAM9X60_definitions SAM9X60 definitions
  This file defines all structures and symbols for SAM9X60:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_U_) || defined(_L_) || defined(_UL_)
#    error "Integer Literals macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#  define _U_(x) (x ## U)    /**< C code: Unsigned integer literal constant value */
#  define _L_(x) (x ## L)    /**< C code: Long integer literal constant value */
#  define _UL_(x) (x ## UL)  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#  define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#  define _L_(x) x    /**< Assembler: Long integer literal constant value */
#  define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */
/** @}  end of Atmel Global Defines */

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAM9X60                                            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  ARM926EJS Processor Exceptions Numbers ******************************/
/******  SAM9X60 specific Interrupt Numbers ***********************************/
  EXT_FIQ_IRQn              =   0, /**< 0   Advanced Interrupt Controller (AIC) */
  PMC_IRQn                  =   1, /**< 1   Shared between PMC WDT SHDWC PIT RTC (PMC) */
  WDT_IRQn                  =   1, /**< 1   Shared between PMC WDT SHDWC PIT RTC (WDT) */
  SHDWC_IRQn                =   1, /**< 1   Shared between PMC WDT SHDWC PIT RTC (SHDWC) */
  PIT_IRQn                  =   1, /**< 1   Shared between PMC WDT SHDWC PIT RTC (PIT) */
  RTC_IRQn                  =   1, /**< 1   Shared between PMC WDT SHDWC PIT RTC (RTC) */
  PIOA_IRQn                 =   2, /**< 2   Parallel Input/Output Controller (PIOA) */
  PIOB_IRQn                 =   3, /**< 3   Parallel Input/Output Controller (PIOB) */
  PIOC_IRQn                 =   4, /**< 4   Parallel Input/Output Controller (PIOC) */
  FLEXCOM0_IRQn             =   5, /**< 5   Flexible Serial Communication (FLEXCOM0) */
  FLEXCOM1_IRQn             =   6, /**< 6   Flexible Serial Communication (FLEXCOM1) */
  FLEXCOM2_IRQn             =   7, /**< 7   Flexible Serial Communication (FLEXCOM2) */
  FLEXCOM3_IRQn             =   8, /**< 8   Flexible Serial Communication (FLEXCOM3) */
  FLEXCOM6_IRQn             =   9, /**< 9   Flexible Serial Communication (FLEXCOM6) */
  FLEXCOM7_IRQn             =  10, /**< 10  Flexible Serial Communication (FLEXCOM7) */
  FLEXCOM8_IRQn             =  11, /**< 11  Flexible Serial Communication (FLEXCOM8) */
  SDMMC0_IRQn               =  12, /**< 12  Secure Digital MultiMedia Card Controller (SDMMC0) */
  FLEXCOM4_IRQn             =  13, /**< 13  Flexible Serial Communication (FLEXCOM4) */
  FLEXCOM5_IRQn             =  14, /**< 14  Flexible Serial Communication (FLEXCOM5) */
  FLEXCOM9_IRQn             =  15, /**< 15  Flexible Serial Communication (FLEXCOM9) */
  FLEXCOM10_IRQn            =  16, /**< 16  Flexible Serial Communication (FLEXCOM10) */
  TC0_IRQn                  =  17, /**< 17  Timer Counter (TC0)                 */
  PWM_IRQn                  =  18, /**< 18  Pulse Width Modulation Controller (PWM) */
  ADC_IRQn                  =  19, /**< 19  Analog-to-Digital Converter (ADC)   */
  XDMAC_IRQn                =  20, /**< 20  Extensible DMA Controller (XDMAC)   */
  MATRIX_IRQn               =  21, /**< 21  AHB Bus Matrix (MATRIX)             */
  UDPHS_IRQn                =  23, /**< 23  USB High Speed Device Port (UDPHS)  */
  EMAC0_IRQn                =  24, /**< 24  Ethernet MAC 10/100 (EMAC0)         */
  LCDC_IRQn                 =  25, /**< 25  LCD Controller (LCDC)               */
  SDMMC1_IRQn               =  26, /**< 26  Secure Digital MultiMedia Card Controller (SDMMC1) */
  EMAC1_IRQn                =  27, /**< 27  Ethernet MAC 10/100 (EMAC1)         */
  SSC_IRQn                  =  28, /**< 28  Synchronous Serial Controller (SSC) */
  CAN0_IRQn                 =  29, /**< 29  Controller Area Network (CAN0)      */
  CAN1_IRQn                 =  30, /**< 30  Controller Area Network (CAN1)      */
  EXT_IRQ_IRQn              =  31, /**< 31  Advanced Interrupt Controller (AIC) */
  FLEXCOM11_IRQn            =  32, /**< 32  Flexible Serial Communication (FLEXCOM11) */
  FLEXCOM12_IRQn            =  33, /**< 33  Flexible Serial Communication (FLEXCOM12) */
  I2SMCC_IRQn               =  34, /**< 34  Inter-IC Sound Multi Channel Controller (I2SMCC) */
  QSPI_IRQn                 =  35, /**< 35  Quad Serial Peripheral Interface (QSPI) */
  GFX2D_IRQn                =  36, /**< 36  2D Graphics Engine (GFX2D)          */
  PIT64B_IRQn               =  37, /**< 37  Periodic Interval Timer 64-bit (PIT64B) */
  TRNG_IRQn                 =  38, /**< 38  True Random Number Generator (TRNG) */
  AES_IRQn                  =  39, /**< 39  Advanced Encryption Standard (AES)  */
  TDES_IRQn                 =  40, /**< 40  Triple Data Encryption Standard (TDES) */
  SHA_IRQn                  =  41, /**< 41  Secure Hash Algorithm (SHA)         */
  CLASSD_IRQn               =  42, /**< 42  Audio Class D Amplifier (CLASSD) (CLASSD) */
  ISI_IRQn                  =  43, /**< 43  Image Sensor Interface (ISI)        */
  PIOD_IRQn                 =  44, /**< 44  Parallel Input/Output Controller (PIOD) */
  TC1_IRQn                  =  45, /**< 45  Timer Counter (TC0)                 */
  OTPC_IRQn                 =  46, /**< 46  OTP Memory Controller (OTPC)        */
  DBGU_IRQn                 =  47, /**< 47  Debug Unit (DBGU)                   */
  PMECC_IRQn                =  48, /**< 48  Programmable Multibit Error Correction Code Controller (PMECC) */
  SDRAMC_IRQn               =  49, /**< 49  Shared between SDRAMC MPDDRC SMC (SDRAMC) */
  MPDDRC_IRQn               =  49, /**< 49  Shared between SDRAMC MPDDRC SMC (MPDDRC) */
  SMC_IRQn                  =  49, /**< 49  Shared between SDRAMC MPDDRC SMC (SMC) */

