Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/atsam9x60.h
/*
 * \brief Configuration of the ARM926EJS Processor and Core Peripherals
 */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#ifdef __cplusplus
  #define   __I     volatile             /*!< \brief Defines 'read only' permissions */
#else
  #define   __I     volatile const       /*!< \brief Defines 'read only' permissions */
#endif
#define     __O     volatile             /*!< \brief Defines 'write only' permissions */
#define     __IO    volatile             /*!< \brief Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*!< \brief Defines 'read only' structure member permissions */
#define     __OM     volatile            /*!< \brief Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*!< \brief Defines 'read / write' structure member permissions */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** \defgroup SAM9X60_api Peripheral Software API
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAM9X60                           */
/* ************************************************************************** */
#include "component/adc.h"
#include "component/aes.h"
#include "component/aic.h"
#include "component/bsc.h"
#include "component/can.h"
#include "component/classd.h"
#include "component/dbgu.h"
#include "component/emac.h"
#include "component/flexcom.h"
#include "component/gfx2d.h"
#include "component/gpbr.h"
#include "component/i2smcc.h"
#include "component/isi.h"
#include "component/lcdc.h"
#include "component/matrix.h"
#include "component/mpddrc.h"
#include "component/otpc.h"
#include "component/pio.h"
#include "component/pit.h"
#include "component/pit64b.h"
#include "component/pmc.h"
#include "component/pmecc.h"
#include "component/pmerrloc.h"
#include "component/pwm.h"
#include "component/qspi.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/rtt.h"
#include "component/sckc.h"
#include "component/sdmmc.h"
#include "component/sdramc.h"
#include "component/sfr.h"
#include "component/sha.h"
#include "component/shdwc.h"
#include "component/smc.h"
#include "component/ssc.h"
#include "component/syscwp.h"
#include "component/tc.h"
#include "component/tdes.h"
#include "component/trng.h"
#include "component/udphs.h"
#include "component/uhpfs.h"
#include "component/uhphs.h"
#include "component/wdt.h"
#include "component/xdmac.h"
/** @}  end of Peripheral Software API */

/** \addtogroup SAM9X60_id Peripheral Ids Definitions
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR SAM9X60                                     */
/* ************************************************************************** */
#define ID_PIOA          (  2) /**< \brief Parallel Input/Output Controller (PIOA) */
#define ID_PIOB          (  3) /**< \brief Parallel Input/Output Controller (PIOB) */
#define ID_PIOC          (  4) /**< \brief Parallel Input/Output Controller (PIOC) */
#define ID_FLEXCOM0      (  5) /**< \brief Flexible Serial Communication (FLEXCOM0) */
#define ID_FLEXCOM1      (  6) /**< \brief Flexible Serial Communication (FLEXCOM1) */
#define ID_FLEXCOM2      (  7) /**< \brief Flexible Serial Communication (FLEXCOM2) */
#define ID_FLEXCOM3      (  8) /**< \brief Flexible Serial Communication (FLEXCOM3) */
#define ID_FLEXCOM6      (  9) /**< \brief Flexible Serial Communication (FLEXCOM6) */
#define ID_FLEXCOM7      ( 10) /**< \brief Flexible Serial Communication (FLEXCOM7) */
#define ID_FLEXCOM8      ( 11) /**< \brief Flexible Serial Communication (FLEXCOM8) */
#define ID_SDMMC0        ( 12) /**< \brief Secure Digital MultiMedia Card Controller (SDMMC0) */
#define ID_FLEXCOM4      ( 13) /**< \brief Flexible Serial Communication (FLEXCOM4) */
#define ID_FLEXCOM5      ( 14) /**< \brief Flexible Serial Communication (FLEXCOM5) */
#define ID_FLEXCOM9      ( 15) /**< \brief Flexible Serial Communication (FLEXCOM9) */
#define ID_FLEXCOM10     ( 16) /**< \brief Flexible Serial Communication (FLEXCOM10) */
#define ID_TC0           ( 17) /**< \brief Timer Counter (TC0) */
#define ID_PWM           ( 18) /**< \brief Pulse Width Modulation Controller (PWM) */
#define ID_ADC           ( 19) /**< \brief Analog-to-Digital Converter (ADC) */
#define ID_XDMAC         ( 20) /**< \brief Extensible DMA Controller (XDMAC) */
#define ID_MATRIX        ( 21) /**< \brief AHB Bus Matrix (MATRIX) */
#define ID_UHPHS_EHCI    ( 22) /**< \brief USB Host High Speed Port (UHPHS_EHCI) */
#define ID_UDPHS         ( 23) /**< \brief USB High Speed Device Port (UDPHS) */
#define ID_EMAC0         ( 24) /**< \brief Ethernet MAC 10/100 (EMAC0) */
#define ID_LCDC          ( 25) /**< \brief LCD Controller (LCDC) */
#define ID_SDMMC1        ( 26) /**< \brief Secure Digital MultiMedia Card Controller (SDMMC1) */
#define ID_EMAC1         ( 27) /**< \brief Ethernet MAC 10/100 (EMAC1) */
#define ID_SSC           ( 28) /**< \brief Synchronous Serial Controller (SSC) */
#define ID_CAN0          ( 29) /**< \brief Controller Area Network (CAN0) */
#define ID_CAN1          ( 30) /**< \brief Controller Area Network (CAN1) */
#define ID_FLEXCOM11     ( 32) /**< \brief Flexible Serial Communication (FLEXCOM11) */
#define ID_FLEXCOM12     ( 33) /**< \brief Flexible Serial Communication (FLEXCOM12) */
#define ID_I2SMCC        ( 34) /**< \brief Inter-IC Sound Multi Channel Controller (I2SMCC) */
#define ID_QSPI          ( 35) /**< \brief Quad Serial Peripheral Interface (QSPI) */
#define ID_GFX2D         ( 36) /**< \brief 2D Graphics Engine (GFX2D) */
#define ID_PIT64B        ( 37) /**< \brief Periodic Interval Timer 64-bit (PIT64B) */
#define ID_TRNG          ( 38) /**< \brief True Random Number Generator (TRNG) */
#define ID_AES           ( 39) /**< \brief Advanced Encryption Standard (AES) */
#define ID_TDES          ( 40) /**< \brief Triple Data Encryption Standard (TDES) */
#define ID_SHA           ( 41) /**< \brief Secure Hash Algorithm (SHA) */
#define ID_CLASSD        ( 42) /**< \brief Audio Class D Amplifier (CLASSD) (CLASSD) */
#define ID_ISI           ( 43) /**< \brief Image Sensor Interface (ISI) */
#define ID_PIOD          ( 44) /**< \brief Parallel Input/Output Controller (PIOD) */
#define ID_TC1           ( 45) /**< \brief Timer Counter (TC1) */
#define ID_OTPC          ( 46) /**< \brief OTP Memory Controller (OTPC) */
#define ID_DBGU          ( 47) /**< \brief Debug Unit (DBGU) */
#define ID_PMECC         ( 48) /**< \brief Programmable Multibit Error Correction Code Controller (PMECC) */
#define ID_SDRAMC        ( 49) /**< \brief SDRAM Controller (SDRAMC) */

