Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/atsam9x60.h
#define ID_PERIPH_MAX    ( 49) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup SAM9X60_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR SAM9X60                       */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define ADC_REGS                         ((adc_registers_t*)0xf804c000)                /**< \brief ADC Registers Address        */
#define AES_REGS                         ((aes_registers_t*)0xf0034000)                /**< \brief AES Registers Address        */
#define AIC_REGS                         ((aic_registers_t*)0xfffff100)                /**< \brief AIC Registers Address        */
#define BSC_REGS                         ((bsc_registers_t*)0xfffffe54)                /**< \brief BSC Registers Address        */
#define CAN0_REGS                        ((can_registers_t*)0xf8000000)                /**< \brief CAN0 Registers Address       */
#define CAN1_REGS                        ((can_registers_t*)0xf8004000)                /**< \brief CAN1 Registers Address       */
#define CLASSD_REGS                      ((classd_registers_t*)0xf003c000)             /**< \brief CLASSD Registers Address     */
#define DBGU_REGS                        ((dbgu_registers_t*)0xfffff200)               /**< \brief DBGU Registers Address       */
#define EMAC0_REGS                       ((emac_registers_t*)0xf802c000)               /**< \brief EMAC0 Registers Address      */
#define EMAC1_REGS                       ((emac_registers_t*)0xf8030000)               /**< \brief EMAC1 Registers Address      */
#define FLEXCOM0_REGS                    ((flexcom_registers_t*)0xf801c000)            /**< \brief FLEXCOM0 Registers Address   */
#define FLEXCOM1_REGS                    ((flexcom_registers_t*)0xf8020000)            /**< \brief FLEXCOM1 Registers Address   */
#define FLEXCOM2_REGS                    ((flexcom_registers_t*)0xf8024000)            /**< \brief FLEXCOM2 Registers Address   */
#define FLEXCOM3_REGS                    ((flexcom_registers_t*)0xf8028000)            /**< \brief FLEXCOM3 Registers Address   */
#define FLEXCOM4_REGS                    ((flexcom_registers_t*)0xf0000000)            /**< \brief FLEXCOM4 Registers Address   */
#define FLEXCOM5_REGS                    ((flexcom_registers_t*)0xf0004000)            /**< \brief FLEXCOM5 Registers Address   */
#define FLEXCOM6_REGS                    ((flexcom_registers_t*)0xf8010000)            /**< \brief FLEXCOM6 Registers Address   */
#define FLEXCOM7_REGS                    ((flexcom_registers_t*)0xf8014000)            /**< \brief FLEXCOM7 Registers Address   */
#define FLEXCOM8_REGS                    ((flexcom_registers_t*)0xf8018000)            /**< \brief FLEXCOM8 Registers Address   */
#define FLEXCOM9_REGS                    ((flexcom_registers_t*)0xf8040000)            /**< \brief FLEXCOM9 Registers Address   */
#define FLEXCOM10_REGS                   ((flexcom_registers_t*)0xf8044000)            /**< \brief FLEXCOM10 Registers Address  */
#define FLEXCOM11_REGS                   ((flexcom_registers_t*)0xf0020000)            /**< \brief FLEXCOM11 Registers Address  */
#define FLEXCOM12_REGS                   ((flexcom_registers_t*)0xf0024000)            /**< \brief FLEXCOM12 Registers Address  */
#define GFX2D_REGS                       ((gfx2d_registers_t*)0xf0018000)              /**< \brief GFX2D Registers Address      */
#define GPBR_REGS                        ((gpbr_registers_t*)0xfffffe60)               /**< \brief GPBR Registers Address       */
#define I2SMCC_REGS                      ((i2smcc_registers_t*)0xf001c000)             /**< \brief I2SMCC Registers Address     */
#define ISI_REGS                         ((isi_registers_t*)0xf8048000)                /**< \brief ISI Registers Address        */
#define LCDC_REGS                        ((lcdc_registers_t*)0xf8038000)               /**< \brief LCDC Registers Address       */
#define MATRIX_REGS                      ((matrix_registers_t*)0xffffde00)             /**< \brief MATRIX Registers Address     */
#define MPDDRC_REGS                      ((mpddrc_registers_t*)0xffffe800)             /**< \brief MPDDRC Registers Address     */
#define OTPC_REGS                        ((otpc_registers_t*)0xeff00000)               /**< \brief OTPC Registers Address       */
#define PIOA_REGS                        ((pio_registers_t*)0xfffff400)                /**< \brief PIOA Registers Address       */
#define PIOB_REGS                        ((pio_registers_t*)0xfffff600)                /**< \brief PIOB Registers Address       */
#define PIOC_REGS                        ((pio_registers_t*)0xfffff800)                /**< \brief PIOC Registers Address       */
#define PIOD_REGS                        ((pio_registers_t*)0xfffffa00)                /**< \brief PIOD Registers Address       */
#define PIT_REGS                         ((pit_registers_t*)0xfffffe40)                /**< \brief PIT Registers Address        */
#define PIT64B_REGS                      ((pit64b_registers_t*)0xf0028000)             /**< \brief PIT64B Registers Address     */
#define PMC_REGS                         ((pmc_registers_t*)0xfffffc00)                /**< \brief PMC Registers Address        */
#define PMECC_REGS                       ((pmecc_registers_t*)0xffffe000)              /**< \brief PMECC Registers Address      */
#define PMERRLOC_REGS                    ((pmerrloc_registers_t*)0xffffe600)           /**< \brief PMERRLOC Registers Address   */
#define PWM_REGS                         ((pwm_registers_t*)0xf8034000)                /**< \brief PWM Registers Address        */
#define QSPI_REGS                        ((qspi_registers_t*)0xf0014000)               /**< \brief QSPI Registers Address       */
#define RSTC_REGS                        ((rstc_registers_t*)0xfffffe00)               /**< \brief RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0xfffffea8)                /**< \brief RTC Registers Address        */
#define RTT_REGS                         ((rtt_registers_t*)0xfffffe20)                /**< \brief RTT Registers Address        */
#define SCKC_REGS                        ((sckc_registers_t*)0xfffffe50)               /**< \brief SCKC Registers Address       */
#define SDMMC0_REGS                      ((sdmmc_registers_t*)0x80000000)              /**< \brief SDMMC0 Registers Address     */
#define SDMMC1_REGS                      ((sdmmc_registers_t*)0x90000000)              /**< \brief SDMMC1 Registers Address     */
#define SDRAMC_REGS                      ((sdramc_registers_t*)0xffffec00)             /**< \brief SDRAMC Registers Address     */
#define SFR_REGS                         ((sfr_registers_t*)0xf8050000)                /**< \brief SFR Registers Address        */
#define SHA_REGS                         ((sha_registers_t*)0xf002c000)                /**< \brief SHA Registers Address        */
#define SHDWC_REGS                       ((shdwc_registers_t*)0xfffffe10)              /**< \brief SHDWC Registers Address      */
#define SMC_REGS                         ((smc_registers_t*)0xffffea00)                /**< \brief SMC Registers Address        */
#define SSC_REGS                         ((ssc_registers_t*)0xf0010000)                /**< \brief SSC Registers Address        */
#define SYSCWP_REGS                      ((syscwp_registers_t*)0xfffffedc)             /**< \brief SYSCWP Registers Address     */
#define TC0_REGS                         ((tc_registers_t*)0xf8008000)                 /**< \brief TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0xf800c000)                 /**< \brief TC1 Registers Address        */
#define TDES_REGS                        ((tdes_registers_t*)0xf0038000)               /**< \brief TDES Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0xf0030000)               /**< \brief TRNG Registers Address       */
#define UDPHS_REGS                       ((udphs_registers_t*)0xf803c000)              /**< \brief UDPHS Registers Address      */
#define UHPHS_OHCI_REGS                  ((uhpfs_registers_t*)0x00600000)              /**< \brief UHPHS_OHCI Registers Address */
#define UHPHS_EHCI_REGS                  ((uhphs_registers_t*)0x00700000)              /**< \brief UHPHS_EHCI Registers Address */
#define WDT_REGS                         ((wdt_registers_t*)0xffffff80)                /**< \brief WDT Registers Address        */
#define XDMAC_REGS                       ((xdmac_registers_t*)0xf0008000)              /**< \brief XDMAC Registers Address      */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup SAM9X60_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAM9X60                                     */
/* ************************************************************************** */
#define ADC_BASE_ADDRESS                 _UL_(0xf804c000)                              /**< \brief ADC Base Address */
#define AES_BASE_ADDRESS                 _UL_(0xf0034000)                              /**< \brief AES Base Address */
#define AIC_BASE_ADDRESS                 _UL_(0xfffff100)                              /**< \brief AIC Base Address */
#define BSC_BASE_ADDRESS                 _UL_(0xfffffe54)                              /**< \brief BSC Base Address */
#define CAN0_BASE_ADDRESS                _UL_(0xf8000000)                              /**< \brief CAN0 Base Address */
#define CAN1_BASE_ADDRESS                _UL_(0xf8004000)                              /**< \brief CAN1 Base Address */
#define CLASSD_BASE_ADDRESS              _UL_(0xf003c000)                              /**< \brief CLASSD Base Address */
#define DBGU_BASE_ADDRESS                _UL_(0xfffff200)                              /**< \brief DBGU Base Address */
#define EMAC0_BASE_ADDRESS               _UL_(0xf802c000)                              /**< \brief EMAC0 Base Address */
#define EMAC1_BASE_ADDRESS               _UL_(0xf8030000)                              /**< \brief EMAC1 Base Address */
#define FLEXCOM0_BASE_ADDRESS            _UL_(0xf801c000)                              /**< \brief FLEXCOM0 Base Address */
#define FLEXCOM1_BASE_ADDRESS            _UL_(0xf8020000)                              /**< \brief FLEXCOM1 Base Address */
#define FLEXCOM2_BASE_ADDRESS            _UL_(0xf8024000)                              /**< \brief FLEXCOM2 Base Address */
#define FLEXCOM3_BASE_ADDRESS            _UL_(0xf8028000)                              /**< \brief FLEXCOM3 Base Address */
#define FLEXCOM4_BASE_ADDRESS            _UL_(0xf0000000)                              /**< \brief FLEXCOM4 Base Address */
#define FLEXCOM5_BASE_ADDRESS            _UL_(0xf0004000)                              /**< \brief FLEXCOM5 Base Address */
#define FLEXCOM6_BASE_ADDRESS            _UL_(0xf8010000)                              /**< \brief FLEXCOM6 Base Address */
#define FLEXCOM7_BASE_ADDRESS            _UL_(0xf8014000)                              /**< \brief FLEXCOM7 Base Address */
#define FLEXCOM8_BASE_ADDRESS            _UL_(0xf8018000)                              /**< \brief FLEXCOM8 Base Address */
#define FLEXCOM9_BASE_ADDRESS            _UL_(0xf8040000)                              /**< \brief FLEXCOM9 Base Address */
#define FLEXCOM10_BASE_ADDRESS           _UL_(0xf8044000)                              /**< \brief FLEXCOM10 Base Address */
#define FLEXCOM11_BASE_ADDRESS           _UL_(0xf0020000)                              /**< \brief FLEXCOM11 Base Address */
#define FLEXCOM12_BASE_ADDRESS           _UL_(0xf0024000)                              /**< \brief FLEXCOM12 Base Address */
#define GFX2D_BASE_ADDRESS               _UL_(0xf0018000)                              /**< \brief GFX2D Base Address */
#define GPBR_BASE_ADDRESS                _UL_(0xfffffe60)                              /**< \brief GPBR Base Address */
#define I2SMCC_BASE_ADDRESS              _UL_(0xf001c000)                              /**< \brief I2SMCC Base Address */
#define ISI_BASE_ADDRESS                 _UL_(0xf8048000)                              /**< \brief ISI Base Address */
#define LCDC_BASE_ADDRESS                _UL_(0xf8038000)                              /**< \brief LCDC Base Address */
#define MATRIX_BASE_ADDRESS              _UL_(0xffffde00)                              /**< \brief MATRIX Base Address */
#define MPDDRC_BASE_ADDRESS              _UL_(0xffffe800)                              /**< \brief MPDDRC Base Address */
#define OTPC_BASE_ADDRESS                _UL_(0xeff00000)                              /**< \brief OTPC Base Address */
#define PIOA_BASE_ADDRESS                _UL_(0xfffff400)                              /**< \brief PIOA Base Address */
#define PIOB_BASE_ADDRESS                _UL_(0xfffff600)                              /**< \brief PIOB Base Address */
#define PIOC_BASE_ADDRESS                _UL_(0xfffff800)                              /**< \brief PIOC Base Address */
#define PIOD_BASE_ADDRESS                _UL_(0xfffffa00)                              /**< \brief PIOD Base Address */
#define PIT_BASE_ADDRESS                 _UL_(0xfffffe40)                              /**< \brief PIT Base Address */
#define PIT64B_BASE_ADDRESS              _UL_(0xf0028000)                              /**< \brief PIT64B Base Address */
#define PMC_BASE_ADDRESS                 _UL_(0xfffffc00)                              /**< \brief PMC Base Address */
#define PMECC_BASE_ADDRESS               _UL_(0xffffe000)                              /**< \brief PMECC Base Address */
#define PMERRLOC_BASE_ADDRESS            _UL_(0xffffe600)                              /**< \brief PMERRLOC Base Address */
#define PWM_BASE_ADDRESS                 _UL_(0xf8034000)                              /**< \brief PWM Base Address */
#define QSPI_BASE_ADDRESS                _UL_(0xf0014000)                              /**< \brief QSPI Base Address */
#define RSTC_BASE_ADDRESS                _UL_(0xfffffe00)                              /**< \brief RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0xfffffea8)                              /**< \brief RTC Base Address */
#define RTT_BASE_ADDRESS                 _UL_(0xfffffe20)                              /**< \brief RTT Base Address */
#define SCKC_BASE_ADDRESS                _UL_(0xfffffe50)                              /**< \brief SCKC Base Address */
#define SDMMC0_BASE_ADDRESS              _UL_(0x80000000)                              /**< \brief SDMMC0 Base Address */
#define SDMMC1_BASE_ADDRESS              _UL_(0x90000000)                              /**< \brief SDMMC1 Base Address */
#define SDRAMC_BASE_ADDRESS              _UL_(0xffffec00)                              /**< \brief SDRAMC Base Address */
#define SFR_BASE_ADDRESS                 _UL_(0xf8050000)                              /**< \brief SFR Base Address */
#define SHA_BASE_ADDRESS                 _UL_(0xf002c000)                              /**< \brief SHA Base Address */
#define SHDWC_BASE_ADDRESS               _UL_(0xfffffe10)                              /**< \brief SHDWC Base Address */
#define SMC_BASE_ADDRESS                 _UL_(0xffffea00)                              /**< \brief SMC Base Address */
#define SSC_BASE_ADDRESS                 _UL_(0xf0010000)                              /**< \brief SSC Base Address */
#define SYSCWP_BASE_ADDRESS              _UL_(0xfffffedc)                              /**< \brief SYSCWP Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0xf8008000)                              /**< \brief TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0xf800c000)                              /**< \brief TC1 Base Address */
#define TDES_BASE_ADDRESS                _UL_(0xf0038000)                              /**< \brief TDES Base Address */
#define TRNG_BASE_ADDRESS                _UL_(0xf0030000)                              /**< \brief TRNG Base Address */
#define UDPHS_BASE_ADDRESS               _UL_(0xf803c000)                              /**< \brief UDPHS Base Address */
#define UHPHS_OHCI_BASE_ADDRESS          _UL_(0x00600000)                              /**< \brief UHPHS_OHCI Base Address */
#define UHPHS_EHCI_BASE_ADDRESS          _UL_(0x00700000)                              /**< \brief UHPHS_EHCI Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0xffffff80)                              /**< \brief WDT Base Address */
#define XDMAC_BASE_ADDRESS               _UL_(0xf0008000)                              /**< \brief XDMAC Base Address */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup SAM9X60_pio Peripheral Pio Definitions
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR SAM9X60                                              */
/* ************************************************************************** */
#include "pio/sam9x60.h"
/** @}  end of Peripheral Pio Definitions */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAM9X60                                   */
/* ************************************************************************** */

