Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/atsam9x60.h
#define EBI_CS0_SIZE                   _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define EBI_CS1_SIZE                   _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define EBI_CS2_SIZE                   _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define EBI_CS3_SIZE                   _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define EBI_NF_SIZE                    _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define EBI_CS4_SIZE                   _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define EBI_CS5_SIZE                   _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define QSPIMEM_SIZE                   _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define SDMMC0_SIZE                    _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define SDMMC1_SIZE                    _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define ECC_ROM_SIZE                   _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define SRAM0_SIZE                     _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define SRAM1_SIZE                     _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define UDPHS_RAM_SIZE                 _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define UHPHS_OHCI_RAM_SIZE            _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define UHPHS_EHCI_RAM_SIZE            _UL_(0x00100000)    /* 1024kB Memory segment type: other */

#define EBI_CS0_ADDR                   _UL_(0x10000000)    /**< EBI_CS0 base address (type: other)*/
#define EBI_CS1_ADDR                   _UL_(0x20000000)    /**< EBI_CS1 base address (type: other)*/
#define EBI_CS2_ADDR                   _UL_(0x30000000)    /**< EBI_CS2 base address (type: other)*/
#define EBI_CS3_ADDR                   _UL_(0x40000000)    /**< EBI_CS3 base address (type: other)*/
#define EBI_NF_ADDR                    _UL_(0x40000000)    /**< EBI_NF base address (type: other)*/
#define EBI_CS4_ADDR                   _UL_(0x50000000)    /**< EBI_CS4 base address (type: other)*/
#define EBI_CS5_ADDR                   _UL_(0x60000000)    /**< EBI_CS5 base address (type: other)*/
#define QSPIMEM_ADDR                   _UL_(0x70000000)    /**< QSPIMEM base address (type: other)*/
#define SDMMC0_ADDR                    _UL_(0x80000000)    /**< SDMMC0 base address (type: other)*/
#define SDMMC1_ADDR                    _UL_(0x90000000)    /**< SDMMC1 base address (type: other)*/
#define ECC_ROM_ADDR                   _UL_(0x00100000)    /**< ECC_ROM base address (type: other)*/
#define SRAM0_ADDR                     _UL_(0x00300000)    /**< SRAM0 base address (type: other)*/
#define SRAM1_ADDR                     _UL_(0x00400000)    /**< SRAM1 base address (type: other)*/
#define UDPHS_RAM_ADDR                 _UL_(0x00500000)    /**< UDPHS_RAM base address (type: other)*/
#define UHPHS_OHCI_RAM_ADDR            _UL_(0x00600000)    /**< UHPHS_OHCI_RAM base address (type: other)*/
#define UHPHS_EHCI_RAM_ADDR            _UL_(0x00700000)    /**< UHPHS_EHCI_RAM base address (type: other)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR SAM9X60                                            */
/* ************************************************************************** */
#define CHIP_JTAGID                    _UL_(0X05B4403F)
#define CHIP_CIDR                      _UL_(0X819B81A0)
#define CHIP_EXID                      _UL_(0X00000002)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR SAM9X60                                       */
/* ************************************************************************** */



#ifdef __cplusplus
}
#endif

/** @}  end of SAM9X60 definitions */


#endif /* _SAM9X60_H_ */

